#include <iostream>

int main() {
    int cost;

    std::cout<<"Сколько хотиите снять ";
    std::cin>>cost;

    if ( (cost%100!=0) || (150000<cost)) {
        std::cout<<"Столько выдать невозможно";
    }

    std::cout<<"Нужно "<< cost/5000 << " пятитысячных купюр\n" << (cost%5000)/2000 << " двухтысячных купюр\n" <<
    ((cost%5000)%2000)/1000 << " тысячных купюр\n" << (((cost%5000)%2000)%1000)/500<< " полутысячных купюр\n" <<
    ((((cost%5000)%2000)%1000)%500)/200 << " купюр по 200 р\n" << (((((cost%5000)%2000)%1000)%500)%200)/100<<" сотен\n ";
}